Repository: shircohen/mozilla-aurora-he-gettext
Catalog: browser/chrome/browser/baseMenuOverlay.dtd.po
Languages: he

source: Minimize
he: מזער חלון

source: Bring All to Front
he: הבא הכול לקדמה

source: Zoom
he: הגדל חלון

source: Window
he: חלון

# helpMenu.label helpMenu.accesskey
source: &Help
he: ע&זרה

# helpMenuWin.label helpMenuWin.accesskey
source: &Help
he: ע&זרה

source: About &brandShorterName;
he: אודות &brandShorterName;

source: &brandShorterName; Help
he: עזרה עבור &brandShorterName;

# productHelp2.accesskey
source: H
he: ע

source: &Keyboard Shortcuts
he: &קיצורי מקלדת

source: &Restart with Add-ons Disabled…
he: הפעלה &מחדש עם תוספות מנוטרלות…

source: &brandShorterName; Health Report
he: דיווח בריאות עבור &brandShorterName;

source: &Troubleshooting Information
he: &מידע לפתרון בעיות

source: &Submit Feedback…
he: &שלח משוב…

source: &brandShorterName; Tour
he: סיור ב־&brandShorterName;

source: o
he: ס

source: Preferences…
he: העדפות…

source: Services
he: שירותים

source: Hide &brandShorterName;
he: הסתרת &brandShorterName;

# hideThisAppCmdMac2.commandkey
source: H
he: ה

source: Hide Others
he: הסתרת אחרים

source: Show All
he: הראה הכול
